Revit 2024 API
BuiltInFailures.LegendFailures.LegendComponentBadViewType Property
 Legend Components may only be placed in Legends
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId LegendComponentBadViewType { get; }
Visual Basic
Public Shared ReadOnly Property LegendComponentBadViewType As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ LegendComponentBadViewType {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.LegendFailures Class
Autodesk.Revit.DB Namespace